src/Catalogs/НаборыСвойств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>НаборыСвойств</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоРеквизитов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоСведений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределенногоНабора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПредопределенногоНабора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеСведения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПредопределенногоНабора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Представления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодЯзыка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/ChartsOfCharacteristicTypes/ДополнительныеРеквизитыИСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>ДополнительныеРеквизитыИСведения</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.СегментыСотрудников</v8:Type>
				<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
				<v8:Type>cfg:CatalogRef.ЗначенияСвойствОбъектов</v8:Type>
				<v8:Type>cfg:TaskRef.Взаимодействие</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>cfg:CatalogRef.СегментыКонтрагентов</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
				<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
				<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>15</v8:Digits>
					<v8:FractionDigits>3</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>1024</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>DateTime</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВключатьВОтчеты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоДополнительноеСведение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьКлиент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьКонтрагент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МножественныйВыбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Группы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

src/Catalogs/НаборыСвойств/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Предопределенный Тогда
		Элементы.Наименование.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ЭтоНаборСвойствКлиент = (Параметры.Ключ = Справочники.НаборыСвойств.Справочник_Клиенты
								ИЛИ Параметры.Ключ = Справочники.НаборыСвойств.Справочник_Контрагенты);
	
	НаборСвойствБылЗаписан = Ложь;
	
	МассивВыбранных = Новый Массив;
	
	Для каждого ДополнительныйРеквизит из Объект.ДополнительныеРеквизиты Цикл
		
		МассивВыбранных.Добавить(ДополнительныйРеквизит.Свойство);
		ТабРеквизиты.Добавить().Свойство = ДополнительныйРеквизит.Свойство;
		
	КонецЦикла;
	
	Для каждого ДополнительноеСведение из Объект.ДополнительныеСведения Цикл
		
		МассивВыбранных.Добавить(ДополнительноеСведение.Свойство);
		ТабСведения.Добавить().Свойство = ДополнительноеСведение.Свойство;
		
	КонецЦикла;
	
	ДеревоСвойств.Параметры.УстановитьЗначениеПараметра("масВыбранных", МассивВыбранных);
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);

КонецПроцедуры

// Процедура - После записи на сервере
//
// Параметры:
//  ТекущийОбъект	 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);

КонецПроцедуры

// Процедура - При чтении на сервере
//
// Параметры:
//  ТекущийОбъект	 - 	 - 
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	РаботаСДиалогами.УстановитьСостояниеОбъекта(ЭтаФорма, Объект.ПометкаУдаления);

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписаноДополнительноеСвойство" Тогда
		ПроверитьСоставыТаблицПослеЗаписиСвойства(Параметр);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект)
	
	ТекущийОбъект.ДополнительныеРеквизиты.Очистить();
	ТекущийОбъект.ДополнительныеСведения.Очистить();
	
	Для каждого ДополнительныйРеквизит Из ТабРеквизиты Цикл
		
		ТекущийОбъект.ДополнительныеРеквизиты.Добавить().Свойство = ДополнительныйРеквизит.Свойство;
		
	КонецЦикла;
	
	Для каждого ДополнительноеСведение Из ТабСведения Цикл
		
		ТекущийОбъект.ДополнительныеСведения.Добавить().Свойство = ДополнительноеСведение.Свойство;
		
	КонецЦикла;
	
	НаборСвойствБылЗаписан = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗавершениеРаботы Тогда 
		Возврат;
	КонецЕсли;
	
	Если НаборСвойствБылЗаписан Тогда
		Оповестить("ИзмененНаборСвойств", Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТабСведения

&НаКлиенте
Процедура ТабРеквизитыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Элементы.ДеревоСвойств.ТекущаяСтрока = Элемент.ТекущиеДанные.Свойство;
КонецПроцедуры

&НаКлиенте
Процедура ТабРеквизитыПослеУдаления(Элемент)
	
	ОбновитьВыбранные();
	
КонецПроцедуры

&НаКлиенте
Процедура ТабРеквизитыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТабСведенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Элементы.ДеревоСвойств.ТекущаяСтрока = Элемент.ТекущиеДанные.Свойство;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоСвойств

&НаКлиенте
Процедура ДеревоСвойствВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДобавитьСвойство();
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСвойствПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	Если Элементы.ДеревоСвойств.ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если (Элементы.ДеревоСвойств.ТекущиеДанные.НомерКартинкиСведения % 3 = 0) Тогда
		ИмяФормыПВХ = "ФормаГруппы";
	Иначе
		ИмяФормыПВХ = "ФормаЭлемента";
	КонецЕсли;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Ключ", Элементы.ДеревоСвойств.ТекущаяСтрока);
	ПараметрыОткрытия.Вставить("ОткрываетсяИзНабораСвойств", Истина);
	ОткрытьФорму("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Форма." + ИмяФормыПВХ, ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоСвойствПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	// Для групп оставим стандартную обработку
	Если Группа = Истина Тогда
		Возврат;
	ИначеЕсли Копирование И (Элементы.ДеревоСвойств.ТекущиеДанные.НомерКартинкиСведения % 3 = 0) Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	ПараметрыОткрытия = Новый Структура;
	
	ПараметрыОткрытия.Вставить("ОткрываетсяИзНабораСвойств", Истина);
	Если Копирование Тогда
		ПараметрыОткрытия.Вставить("Копируемый", Элементы.ДеревоСвойств.ТекущаяСтрока);
	Иначе
		ПараметрыОткрытия.Вставить("Родитель", Родитель);
	КонецЕсли;
	ПараметрыОткрытия.Вставить("ЭтоНаборСвойствКлиент", ЭтоНаборСвойствКлиент);
	
	ОткрытьФорму("ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Форма.ФормаЭлемента", ПараметрыОткрытия);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьСвойствоВыполнить()
	ДобавитьСвойство();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
 
&НаКлиенте
Процедура ОбновитьВыбранные()
	
	масВыбранных = Новый Массив;
	
	Для Каждого Стр Из ТабРеквизиты Цикл
		масВыбранных.Добавить(Стр.Свойство);
	КонецЦикла;
	
	Для Каждого Стр Из ТабСведения Цикл
		масВыбранных.Добавить(Стр.Свойство);
	КонецЦикла;
	
	ДеревоСвойств.Параметры.УстановитьЗначениеПараметра("масВыбранных", масВыбранных);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьТекущимВТаблице(Таблица, Элемент, Свойство)
	
	Если Свойство = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура("Свойство", Свойство);
	Строки = Таблица.НайтиСтроки(Отбор);
	Если Строки.Количество() <> 0 Тогда
		Элемент.ТекущаяСтрока = Таблица.Индекс(Строки[0]);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроизвестиДобавлениеВыделенныхСвойств(масСсылок, масР, масС)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	|	ДополнительныеРеквизитыИСведения.Ссылка КАК Свойство
	|ПОМЕСТИТЬ Временная
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|ГДЕ
	|	(ДополнительныеРеквизитыИСведения.Ссылка В (&масР)
	|			ИЛИ ДополнительныеРеквизитыИСведения.Ссылка В (&масС))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ  РАЗРЕШЕННЫЕ
	|	ДополнительныеРеквизитыИСведения.Ссылка,
	|	ДополнительныеРеквизитыИСведения.ЭтоДополнительноеСведение
	|ИЗ
	|	ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ Временная КАК Временная
	|		ПО ДополнительныеРеквизитыИСведения.Ссылка = Временная.Свойство
	|ГДЕ
	|	ДополнительныеРеквизитыИСведения.Ссылка В ИЕРАРХИИ(&масСсылок)
	|	И (НЕ ДополнительныеРеквизитыИСведения.ЭтоГруппа)
	|	И Временная.Свойство ЕСТЬ NULL 
	|	И (НЕ ДополнительныеРеквизитыИСведения.ПометкаУдаления)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДополнительныеРеквизитыИСведения.Наименование";
	
	Запрос.УстановитьПараметр("масСсылок", масСсылок);
	Запрос.УстановитьПараметр("масР", масР);
	Запрос.УстановитьПараметр("масС", масС);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	масР.Очистить();
	масС.Очистить();
	
	Если Выборка.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ЭтоДополнительноеСведение Тогда
			масС.Добавить(Выборка.Ссылка);
		Иначе
			масР.Добавить(Выборка.Ссылка);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьСвойство()
	
	масДобавлять = Новый Массив;
	ПоследнийР = Неопределено;
	ПоследнийС = Неопределено;

	Для Каждого выдСсылка Из Элементы.ДеревоСвойств.ВыделенныеСтроки Цикл
		Отбор = Новый Структура("Свойство", выдСсылка);
		Если ТабРеквизиты.НайтиСтроки(Отбор).Количество() <> 0 Тогда
			ПоследнийР = выдСсылка;
		ИначеЕсли ТабСведения.НайтиСтроки(Отбор).Количество() <> 0 Тогда
			ПоследнийС = выдСсылка;
		Иначе
			масДобавлять.Добавить(выдСсылка);
		КонецЕсли;
	КонецЦикла;
	
	Если масДобавлять.Количество() > 0 Тогда
		
		масР = Новый Массив;
		Для Каждого Стр Из ТабРеквизиты Цикл
			масР.Добавить(Стр.Свойство);
		КонецЦикла;
		
		масС = Новый Массив;
		Для Каждого Стр Из ТабСведения Цикл
			масС.Добавить(Стр.Свойство);
		КонецЦикла;
		
		Если ПроизвестиДобавлениеВыделенныхСвойств(масДобавлять, масР, масС) Тогда
			Модифицированность = Истина;
			
			Для Каждого Свойство Из масР Цикл
				новСтр = ТабРеквизиты.Добавить();
				новСтр.Свойство = Свойство;
				ПоследнийР = Свойство;
			КонецЦикла;
			
			Для Каждого Свойство Из масС Цикл
				новСтр = ТабСведения.Добавить();
				новСтр.Свойство = Свойство;
				ПоследнийС = Свойство;
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	УстановитьТекущимВТаблице(ТабРеквизиты, Элементы.ТабРеквизиты, ПоследнийР);
	УстановитьТекущимВТаблице(ТабСведения,  Элементы.ТабСведения,  ПоследнийС);
	
	ОбновитьВыбранные();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСоставыТаблицПослеЗаписиСвойства(СтруктураОповещения)
	
	// Определим, из какой таблицы в какую возможно может потребоваться переносить доп. свойство
	Если СтруктураОповещения.ЭтоДополнительноеСведение Тогда
		Таблица1 = ТабСведения;
		Таблица2 = ТабРеквизиты;
	Иначе
		Таблица1 = ТабРеквизиты;
		Таблица2 = ТабСведения;
	КонецЕсли;
	
	// Проверим, входит ли свойство в таблицу, из которой нужно переносить
	Свойство = СтруктураОповещения.Ссылка;
	Строки = Таблица2.НайтиСтроки(Новый Структура("Свойство", Свойство));
	Если Строки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	// Удалим из одной таблицы
	Индекс = Таблица2.Индекс(Строки[0]);
	Таблица2.Удалить(Индекс);
	
	// Добавим в другую
	новСтр = Таблица1.Добавить();
	новСтр.Свойство = Свойство;
	
	// Установим флаг, отвечающий за то, чтобы в формах элементов со свойствами обновились данные
	НаборСвойствБылЗаписан = Истина;
	
КонецПроцедуры

#КонецОбласти
